app/controllers/telegram_controller.rb

INSERT INTO "reviewers" ("telegram_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["telegram_id", "173669942"], ["created_at", "2016-02-24 08:55:09.665558"], ["updated_at", "2016-02-24 08:55:09.665558"]]
SELECT  "reviewers".* FROM "reviewers" WHERE "reviewers"."telegram_id" = ? LIMIT 1  [["telegram_id", "173669942"]]
---
  def incoming
  	# telegram parameters are stored in a hash
  	# we access them to get important information out of it
  	chat_id = params["message"]["chat"]["id"]
  	message = params["message"]["text"]

    # find the reviewer with that chat_id and if it doesn't exist create it
  	reviewer = Reviewer.find_or_create_by! telegram_id: chat_id